system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.4 -0.4 0.01) //0
    (1 -0.4 0.01) //1
    (1 0.4 0.01)  //2
    (-0.4 0.4 0.01)  //3
	
    (-0.4 -0.4 -0.01)  //4
    (1 -0.4 -0.01)  //5
    (1 0.4 -0.01)  //6
    (-0.4 0.4 -0.01)  //7
);

blocks
(
    hex (4 5 6 7 0 1 2 3) (70 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
	top
    {
        type slip;
        faces
        (
            (3 2 6 7)
			
        );
    }
    Bottom
    {
        type slip;
        faces
        (
            
			(0 1 5 4)
        );
    }

	front
    {
        type slip;
        faces
        (
            
			(0 1 2 3)
        );
    }
	Back
    {
        type slip;
        faces
        (
            
			(4 5 6 7)	
        );
    }
   
);

mergePatchPairs
(
);

// ************	************************************************************* //
